Documents/КурсовыеРазницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>КурсовыеРазницы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПрогноз</Name>
					<Comment>означает, что этот документ - планируемый, т.е.вместо него будет введе другой документ, не обязательно с такими же параметрами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВСбережениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДРСбер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>сумма в валюте кошелька</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогноз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПрогнозРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>флВнутреннее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/КурсовыеРазницы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Курс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.Курс = Курс.Курс;
	Объект.Кратность = Курс.Кратность;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	Объект.Валюта = ОбщийМодуль1Сервер.ПолучитьВалютуВалютуКошелька(Объект.Кошелек);
	ВалютаПриИзменении(Неопределено)
КонецПроцедуры


&НаКлиенте
Процедура Рассчитать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Вопрос("Перед выполнением этой операции требуется записать документ. ОК?", 
			РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена) = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Объект.Сумма = РассчитатьСервер();
	Модифицированность = Истина;
КонецПроцедуры

Функция РассчитатьСервер()

	//выполнить запрос по остаткам денег
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.Кошелек,
	|	ДенежныеСредстваОстатки.СуммаОстаток,
	|	ДенежныеСредстваОстатки.СуммаРеглОстаток,
	|	ДенежныеСредстваОстатки.СуммаПрогнозОстаток,
	|	ДенежныеСредстваОстатки.СуммаПрогнозРеглОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&Граница) КАК ДенежныеСредстваОстатки";

	Если ЗначениеЗаполнено(Объект.Кошелек) Тогда
		запрос.Текст=запрос.Текст+"
		|ГДЕ
		|	ДенежныеСредстваОстатки.Кошелек = &Кошелек";
		Запрос.УстановитьПараметр("Кошелек", Объект.Кошелек);
	КонецЕсли;
	//на границу до даты этого документа
	ПараметрыГ = Новый Массив;
	//чтобы точно знать момент времени. если док уже существует - берем его время
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыГ.Добавить(Объект.Дата);
	Иначе
		//если это новый - берем начало дня
		ПараметрыГ.Добавить(НачалоДня(Объект.Дата));
	КонецЕсли;
		
	ПараметрыГ.Добавить(ВидГраницы.Исключая);  //так правильно
	//ПараметрыГ.Добавить(ВидГраницы.Включая);
	
	Граница = Новый (Тип("Граница"), ПараметрыГ);
	Запрос.УстановитьПараметр("Граница", Граница);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		КурсЦБ 			= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
		
		НовыйКурс 		= ?(ЗначениеЗаполнено(Объект.Курс), Объект.Курс, КурсЦБ.Курс);
		НоваяКратность 	= ?(ЗначениеЗаполнено(Объект.Кратность), Объект.Кратность, КурсЦБ.Кратность);
		
		Разница 		= ОбщийМодуль1Сервер.ПолучитьСуммуВВалютеРегл(Выборка.СуммаОстаток, Объект.Валюта, НовыйКурс, НоваяКратность)-Выборка.СуммаРеглОстаток;
		
		Возврат Разница;
		
	КонецЦикла;

КонецФункции

&НаКлиенте
Процедура ОбновитьКурс(Команда)
	ВалютаПриИзменении(Неопределено);
КонецПроцедуры
